Question-1

head(): This function returns the first n rows of a DataFrame. By default, it returns the first five rows.

In [3]:
import pandas as pd

# Create a DataFrame
data = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                     'B': ['a', 'b', 'c', 'd', 'e']})

# Display the first three rows
print(data.head(3))

   A  B
0  1  a
1  2  b
2  3  c

info(): This function provides a summary of the DataFrame, including the data types of columns and information about missing values.

In [7]:
import pandas as pd

data = pd.DataFrame({'A': [1, 2, 3],
                     'B': ['a', 'b', None]})
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       2 non-null      object
dtypes: int64(1), object(1)
memory usage: 176.0+ bytes

groupby(): This function is used to group the data in a DataFrame based on one or more columns.

In [9]:
import pandas as pd

data = pd.DataFrame({'Name': ['John', 'Jane', 'John', 'Jane'],
                     'City': ['New York', 'London', 'Paris', 'London'],
                     'Age': [25, 30, 35, 40]})

grouped_data = data.groupby('Name')

for name, group in grouped_data:
    print(name)
    print(group)
    print()

Jane
   Name    City  Age
1  Jane  London   30
3  Jane  London   40

John
   Name      City  Age
0  John  New York   25
2  John     Paris   35

sort_values(): This function is used to sort the rows of a DataFrame based on one or more columns.

In [10]:
import pandas as pd

# Create a DataFrame
data = pd.DataFrame({'Name': ['John', 'Jane', 'Alex'],
                     'Age': [25, 30, 20]})
sorted_data = data.sort_values('Age')
print(sorted_data)

   Name  Age
2  Alex   20
0  John   25
1  Jane   30

Question-2

In [15]:
import pandas as pd

def reindex_dataframe(df):
    df = df.reset_index(drop=True)
    df.index = pd.RangeIndex(start=1, stop=2*len(df)+1, step=2)
    return df

In [17]:
data = pd.DataFrame({'Name': ['John', 'Jane', 'Alex'],
                     'Age': [25, 30, 20]})
reindexed_df = reindex_dataframe(data)
print(reindexed_df)

   Name  Age
1  John   25
3  Jane   30
5  Alex   20

Question-3

In [21]:
data = pd.DataFrame()

In [44]:
data['Values']=[10,20,30,40,50]
data['Name']=['John', 'Jane', 'Alex','Bob','Mick']

In [77]:
data

   Values  Name
0      10  John
1      20  Jane
2      30  Alex
3      40   Bob
4      50  Mick

In [104]:
def summ(data):
    ans=0
    for i in data["Values"][:3]:
        ans+=i
        # print(i)
    return ans

In [105]:

summ(data)

60

Queston-4

In [108]:
data=pd.DataFrame()
data['Text']=['John', 'Jane', 'Alex','Bob','Mick']

In [109]:
data

   Text
0  John
1  Jane
2  Alex
3   Bob
4  Mick

In [118]:
data['Word_count']=data['Text'].apply(lambda x:len(x))

In [119]:
data

   Text  Word_count
0  John           4
1  Jane           4
2  Alex           4
3   Bob           3
4  Mick           4

Question-5

In [121]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
size = df.size

print(size)

6

In [122]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
shape = df.shape

print(shape)

(3, 2)

Question-6

To read an Excel file using pandas, you can use the read_excel() function. This function allows you to read data from an Excel file and create a DataFrame.

Question-7

In [123]:
df = pd.DataFrame({'Email': ["sai@gmail.com", "sdfsadf.das@domain.com", "sadfsd_sf@example.com"]})
df['Username']=df['Email'].apply(lambda x:x[:x.index("@")])

In [124]:
df

                    Email     Username
0           sai@gmail.com          sai
1  sdfsadf.das@domain.com  sdfsadf.das
2   sadfsd_sf@example.com    sadfsd_sf

Question-8

In [131]:
from random import randint
data={"A":[],"B":[],"C":[]}
for i in range(10):
        data['A'].append(randint(1,20))
        data['B'].append(randint(1,20))
        data['C'].append(randint(1,20))
data=pd.DataFrame(data)
print(data)

data=data[(data['A']>5) & (data['B']<10)]
print(data)

    A   B   C
0  17  14   8
1  15   9  13
2  16  14  20
3   2  17   5
4  19  19  10
5  19   7  17
6   7  16  12
7   9  17   1
8  16   7   4
9  16  18   7
    A  B   C
1  15  9  13
5  19  7  17
8  16  7   4

Question-9

In [139]:
data=pd.DataFrame()
data['Values']=[70,21,35,48,55]

print(data['Values'].mean())
print(data['Values'].median())
print(data['Values'].std())

45.8
48.0
18.75366630821824

Question-10

In [141]:
import pandas as pd

def calculate_moving_average(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    return df

data={"Sales":[12,33,1,21,31,13,33,80,99,100],"Date":["10-10-2023","11-10-2023","12-10-2023","13-10-2023","14-10-2023","15-10-2023","16-10-2023","17-10-2023","18-10-2023","19-10-2023"]}
data=pd.DataFrame(data)
data

   Sales        Date
0     12  10-10-2023
1     33  11-10-2023
2      1  12-10-2023
3     21  13-10-2023
4     31  14-10-2023
5     13  15-10-2023
6     33  16-10-2023
7     80  17-10-2023
8     99  18-10-2023
9    100  19-10-2023

In [142]:
calculate_moving_average(data)

   Sales        Date  MovingAverage
0     12  10-10-2023      12.000000
1     33  11-10-2023      22.500000
2      1  12-10-2023      15.333333
3     21  13-10-2023      16.750000
4     31  14-10-2023      19.600000
5     13  15-10-2023      18.500000
6     33  16-10-2023      20.571429
7     80  17-10-2023      30.285714
8     99  18-10-2023      39.714286
9    100  19-10-2023      53.857143

Question-11

In [143]:
data={"Date":["10-10-2023","11-10-2023","12-10-2023","13-10-2023","14-10-2023","15-10-2023","16-10-2023","17-10-2023","18-10-2023","19-10-2023"]}
data=pd.DataFrame(data)
data

         Date
0  10-10-2023
1  11-10-2023
2  12-10-2023
3  13-10-2023
4  14-10-2023
5  15-10-2023
6  16-10-2023
7  17-10-2023
8  18-10-2023
9  19-10-2023

In [146]:
import datetime
import calendar

def findDay(date):
    born = datetime.datetime.strptime(date, '%d-%m-%Y').weekday()
    return (calendar.day_name[born])

data['Weekday']=data['Date'].apply(findDay)
data

         Date    Weekday
0  10-10-2023    Tuesday
1  11-10-2023  Wednesday
2  12-10-2023   Thursday
3  13-10-2023     Friday
4  14-10-2023   Saturday
5  15-10-2023     Sunday
6  16-10-2023     Monday
7  17-10-2023    Tuesday
8  18-10-2023  Wednesday
9  19-10-2023   Thursday

Question-12

In [147]:
df = pd.DataFrame({'Date': pd.date_range(start='2022-09-01', end='2023-05-31', periods=10)})

In [148]:
df

                 Date
0 2022-09-01 00:00:00
1 2022-10-01 05:20:00
2 2022-10-31 10:40:00
3 2022-11-30 16:00:00
4 2022-12-30 21:20:00
5 2023-01-30 02:40:00
6 2023-03-01 08:00:00
7 2023-03-31 13:20:00
8 2023-04-30 18:40:00
9 2023-05-31 00:00:00

In [149]:
df[(df['Date']>='2023-01-01') & (df['Date']<='2023-01-31')]

                 Date
5 2023-01-30 02:40:00

Question-13

In [150]:
import pandas as pd